Extensions/FortMonitorAPI_ТЛЭ/Documents/уатПутевойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уатПутевойЛист</Name>
		</Properties>
	</Document>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Catalogs/SDL_НастройкиФортМонитор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>SDL_НастройкиФортМонитор</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФортМонитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУчетныеЗаписиСистемыМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалЗагрузки</Name>
					<Comment>Загрузка данных регламентным заданием за указанное время (хранится в сек.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьПробегРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьКоординаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПоясБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_РаботаСHTTPСервисами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетОдометраПоПробегуНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ИспользоватьУниверсальноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетПробегаПоОдометруНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Documents/уатПутевойЛист/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
&После("ЗаполнитьПоМониторингуПриВозврате")
Процедура SDLЗаполнитьПоМониторингуПриВозврате(Команда)
	Если ЭтоГлонасс(Объект.ТранспортноеСредство) Тогда
	ОбъектСтруктура = Новый Структура;
	ОбъектСтруктура.Вставить("Организация",           Объект.Организация);
	ОбъектСтруктура.Вставить("ТранспортноеСредство",  Объект.ТранспортноеСредство);
	ОбъектСтруктура.Вставить("ДатаВыезда",            Объект.ДатаВыезда);
	ОбъектСтруктура.Вставить("ДатаВозвращения",       Объект.ДатаВозвращения);
	ОбъектСтруктура.Вставить("СпидометрВыезда",       Объект.СпидометрВыезда);
	ОбъектСтруктура.Вставить("СпидометрВозвращения",  Объект.СпидометрВозвращения);
	ОбъектСтруктура.Вставить("РасчетФактРасходаГСМ",  Объект.РасчетФактРасходаГСМ);
	ОбъектСтруктура.Вставить("Прицепы",               Новый Массив());
	
	Для Каждого ТекПрицеп Из Объект.Прицепы Цикл 
		СтрокаПрицепа = Новый Структура("ТС, СпидометрВыезда, СпидометрВозвращения",
			ТекПрицеп.ТС,
			ТекПрицеп.СчетчикМЧВыезда,
			ТекПрицеп.СчетчикМЧВозвращения);
		ОбъектСтруктура.Прицепы.Добавить(СтрокаПрицепа);
	КонецЦикла;
	
	РезультатСтруктура = Новый Структура;
	
	// РАСЧЕТ.
  	SDL_РассчетГлонасс.РассчитатьЗначенияГлонасс(ОбъектСтруктура, РезультатСтруктура);
	
	НайденныеСтроки = ВыработкаТСсводная.НайтиСтроки(Новый Структура("ПараметрВыработки", 
		ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ПробегОбщийПоДаннымGPS")));
	Если НайденныеСтроки.Количество() > 0 Тогда 
		СтрокаВыработкиПробег = НайденныеСтроки[0];
	Иначе 
		СтрокаВыработкиПробег = Неопределено;
	КонецЕсли;
	
	НайденныеСтроки = ВыработкаТСсводная.НайтиСтроки(Новый Структура("ПараметрВыработки", 
		ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ВремяВРаботеПоДаннымGPS")));
	Если НайденныеСтроки.Количество() > 0 Тогда 
		СтрокаВыработкиВремяВРаботе = НайденныеСтроки[0];
	Иначе 
		СтрокаВыработкиВремяВРаботе = Неопределено;
	КонецЕсли;
	
	// Заполнение основных реквизитов.
	Если РезультатСтруктура.Свойство("СчетчикВозвращения") Тогда
		Объект.СпидометрВозвращения = РезультатСтруктура.СчетчикВозвращения;
	КонецЕсли;
	Если РезультатСтруктура.Свойство("СчетчикПоGPS") Тогда 
		
		// {30.09.2024  
		Объект.ПробегПоGPS = РезультатСтруктура.СчетчикПоGPS;
        ТекстПользователю = "ПробегПоGPS: " + Формат(Объект.ПробегПоGPS,"ЧДЦ=0; ЧН=Ноль")+ " км.";
        Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстПользователю;
		Сообщение.Сообщить();
		//  СК 07-02-2024
		// Пересчет одометра по пробегу на возврат
		Если ПересчетОдометраПоПробегуНаВозврат() Тогда
			Объект.ПробегПоGPS = РезультатСтруктура.СчетчикПоGPS;
			Объект.СпидометрВозвращения = Объект.СпидометрВыезда + Объект.ПробегПоGPS; 
		ИначеЕсли ПересчетПробегаПоОдометруНаВозврат() Тогда
			Объект.СпидометрВозвращения = РезультатСтруктура.СчетчикВозвращения;
			Объект.ПробегПоGPS = Объект.СпидометрВозвращения - Объект.СпидометрВыезда;  
		КонецЕсли;	
		// }30.09.2024
	КонецЕсли;
	Если РезультатСтруктура.Свойство("ПробегПоGPS") И Не СтрокаВыработкиПробег = Неопределено Тогда
		СтрокаВыработкиПробег.К1 = Окр(РезультатСтруктура.ПробегПоGPS, 2, РежимОкругления.Окр15как20);
		ЗаписатьСтрокуВыработкиТСсервер(Объект.ТранспортноеСредство, СтрокаВыработкиПробег.ПараметрВыработки, СтрокаВыработкиПробег.К1);
	КонецЕсли;
	Если РезультатСтруктура.Свойство("МоточасыПоGPS") И Не СтрокаВыработкиВремяВРаботе = Неопределено Тогда
		СтрокаВыработкиВремяВРаботе.К1 = ВремяВЧЧ_ММ(РезультатСтруктура.МоточасыПоGPS*3600);
		ЗаписатьСтрокуВыработкиТСсервер(Объект.ТранспортноеСредство, СтрокаВыработкиВремяВРаботе.ПараметрВыработки,
			уатОбщегоНазначения.уатВремяВСекунды(СтрокаВыработкиВремяВРаботе.К1));
	КонецЕсли;
		

	
	ОбновитьПараметрВыработкиТСВременный();
	
	Если РезультатСтруктура.Свойство("РасходТоплива") Тогда
		SDLЗаполнитьГСМПоGPSСервер(РезультатСтруктура);
	Иначе
		ЗаполнитьГСМПоGPSСервер();
	КонецЕсли;

	ОбновитьНадписьПробег();
	ЗаполнитьПробегПоУмолчаниюПриРаботеНаДвухВидахТоплива();
	
	Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура SDLЗаполнитьГСМПоGPSСервер(РезультатСтруктура, флВыезд = Ложь)
	ПараметрыРасчетаГСМ = уатПутевыеЛисты.ПолучитьПараметрыРасчетаРасходаГСМ(Объект);
	
	SDL_РассчетГлонасс.SDLЗаполнитьГСМПоGPSСервер(Объект, ПараметрыРасчетаГСМ, РезультатСтруктура, флВыезд);

	Если флВыезд И ПараметрыРасчетаГСМ.Свойство("ОстатокТопливаВыезд") Тогда
		ОстатокТопливаВыезд = ПараметрыРасчетаГСМ.ОстатокТопливаВыезд;
	ИначеЕсли НЕ флВыезд И ПараметрыРасчетаГСМ.Свойство("ОстатокТопливаВозврат") Тогда
		ОстатокТопливаВозврат = ПараметрыРасчетаГСМ.ОстатокТопливаВозврат;
	КонецЕсли;

КонецПроцедуры


Функция ЭтоГлонасс(ТС)
	Если ТС.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.НайтиПоНаименованию("FortMonitor") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// 30.09.2024
Функция ПересчетОдометраПоПробегуНаВозврат()
	
	Результат = Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	SDL_НастройкиФортМонитор.Ссылка КАК Ссылка,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетОдометраПоПробегуНаВозврат КАК SDL_ПересчетОдометраПоПробегуНаВозврат
	|ИЗ
	|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор
	|ГДЕ
	|	НЕ SDL_НастройкиФортМонитор.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.SDL_ПересчетОдометраПоПробегуНаВозврат;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

// 30.09.2024
Функция ПересчетПробегаПоОдометруНаВозврат()
	
	Результат = Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	SDL_НастройкиФортМонитор.Ссылка КАК Ссылка,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетПробегаПоОдометруНаВозврат КАК SDL_ПересчетПробегаПоОдометруНаВозврат
	|ИЗ
	|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор
	|ГДЕ
	|	НЕ SDL_НастройкиФортМонитор.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.SDL_ПересчетПробегаПоОдометруНаВозврат;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
